---
title: EnergyAnalysisSurface
classe: Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 21
---

# EnergyAnalysisSurface

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Azimuth { get; }` | `energyAnalysisSurface.Azimuth` | Double |
| `String CADLinkUniqueId { get; }` | `energyAnalysisSurface.CADLinkUniqueId` | String |
| `String CADObjectUniqueId { get; }` | `energyAnalysisSurface.CADObjectUniqueId` | String |
| `XYZ Corner { get; }` | `energyAnalysisSurface.Corner` | XYZ |
| `Double Height { get; }` | `energyAnalysisSurface.Height` | Double |
| `XYZ Normal { get; }` | `energyAnalysisSurface.Normal` | XYZ |
| `String OriginatingElementDescription { get; }` | `energyAnalysisSurface.OriginatingElementDescription` | String |
| `LinkElementId OriginatingElementId { get; }` | `energyAnalysisSurface.OriginatingElementId` | LinkElementId |
| `String OriginatingElementName { get; }` | `energyAnalysisSurface.OriginatingElementName` | String |
| `String SurfaceId { get; }` | `energyAnalysisSurface.SurfaceId` | String |
| `String SurfaceName { get; }` | `energyAnalysisSurface.SurfaceName` | String |
| `EnergyAnalysisSurfaceType SurfaceType { get; }` | `energyAnalysisSurface.SurfaceType` | EnergyAnalysisSurfaceType |
| `Double Tilt { get; }` | `energyAnalysisSurface.Tilt` | Double |
| `gbXMLSurfaceType Type { get; }` | `energyAnalysisSurface.Type` | gbXMLSurfaceType |
| `Double Width { get; }` | `energyAnalysisSurface.Width` | Double |
| `EnergyAnalysisSpace GetAdjacentAnalyticalSpace()` | `energyAnalysisSurface.GetAdjacentAnalyticalSpace()` | EnergyAnalysisSpace |
| `IList<EnergyAnalysisOpening> GetAnalyticalOpenings()` | `energyAnalysisSurface.GetAnalyticalOpenings()` | IList<EnergyAnalysisOpening> |
| `EnergyAnalysisSpace GetAnalyticalSpace()` | `energyAnalysisSurface.GetAnalyticalSpace()` | EnergyAnalysisSpace |
| `EnergyAnalysisConstruction GetConstruction()` | `energyAnalysisSurface.GetConstruction()` | EnergyAnalysisConstruction |
| `Polyloop GetPolyloop()` | `energyAnalysisSurface.GetPolyloop()` | Polyloop |
| `IList<Polyloop> GetPolyloops()` | `energyAnalysisSurface.GetPolyloops()` | IList<Polyloop> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```